{
  "vocab_size": 64044,
  "d_model": 192,
  "decoder_layers": 4,
  "decoder_attention_heads": 3,
  "decoder_ffn_dim": 1024,
  "activation_function": "relu",
  "max_position_embeddings": 512,
  "dropout": 0.0,
  "attention_dropout": 0.0,
  "activation_dropout": 0.0,
  "init_std": 0.02,
  "decoder_layerdrop": 0.0,
  "use_cache": false,
  "scale_embedding": true,
  "use_learned_position_embeddings": true,
  "layernorm_embedding": true,
  "return_dict": true,
  "output_hidden_states": false,
  "output_attentions": false,
  "torchscript": false,
  "torch_dtype": null,
  "use_bfloat16": false,
  "tf_legacy_loss": false,
  "pruned_heads": {},
  "tie_word_embeddings": true,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "is_decoder": true,
  "cross_attention_hidden_size": 384,
  "add_cross_attention": true,
  "tie_encoder_decoder": false,
  "max_length": 20,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "architectures": null,
  "finetuning_task": null,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": 0,
  "pad_token_id": 1,
  "eos_token_id": 2,
  "sep_token_id": null,
  "decoder_start_token_id": 2,
  "task_specific_params": null,
  "problem_type": null,
  "_name_or_path": "",
  "_attn_implementation_autoset": false,
  "transformers_version": "4.46.2",
  "classifier_dropout": 0.0,
  "model_type": "trocr",
  "intermediate_size": 768,
  "hidden_dropout": 0.0
}